export const knowledge = [
  {
    question: "창세기에서 하나님이 첫째 날에 하신 일은 무엇인가요?",
    options: ["빛 창조", "땅과 바다 분리", "식물 창조", "별 창조"],
    correct: "빛 창조",
  },
  {
    question: "노아의 방주에 들어간 동물의 종류는 몇 쌍씩 들어갔나요?",
    options: ["한 쌍", "두 쌍", "세 쌍", "네 쌍"],
    correct: "한 쌍",
  },
  {
    question: "아브라함의 아들 중 이삭의 어머니는 누구인가요?",
    options: ["하갈", "사라", "리브가", "레아"],
    correct: "사라",
  },
  {
    question: "요셉이 형들에게 팔려간 나라는 어디인가요?",
    options: ["이집트", "바빌론", "가나안", "미디안"],
    correct: "이집트",
  },
  {
    question: "모세가 이스라엘 백성을 이끌고 탈출할 때 건넌 바다는 무엇인가요?",
    options: ["홍해", "갈릴리 호수", "요르단 강", "지중해"],
    correct: "홍해",
  },
  {
    question: "여호수아가 이스라엘 백성과 함께 함락시킨 성은?",
    options: ["예리코 성", "베델", "벨라", "에돔"],
    correct: "예리코 성",
  },
  {
    question: "사무엘 선지자는 누구의 어릴 적부터 하나님을 섬겼나요?",
    options: ["사울", "다윗", "솔로몬", "여호수아"],
    correct: "사울",
  },
  {
    question: "다윗이 골리앗을 이긴 무기는 무엇인가요?",
    options: ["칼", "창", "돌멩이", "활"],
    correct: "돌멩이",
  },
  {
    question: "솔로몬 왕은 어떤 성전을 건축했나요?",
    options: ["예루살렘 성전", "바벨론 성전", "에덴 동산", "시온 성당"],
    correct: "예루살렘 성전",
  },
  {
    question: "예언자 이사야가 예언한 메시아의 통치는 언제 시작되나요?",
    options: ["영원히", "일시적", "잠정적", "미래에 한시적으로"],
    correct: "영원히",
  },
];
